Chopin07/SUSTECH-OE/电子科学创新实验I/for stm32/Homework/3/key/key_Transfer/User/key/key.c
#include "key.h"
#include "stm32f10x.h"
#include "delay.h"
#include "led.h"

#define KEY_ON  1
#define KEY_OFF 0

void Key_GPIO_Config(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    /*开启按键端口的时钟*/
    RCC_APB2PeriphClockCmd(KEY1_GPIO_CLK|KEY2_GPIO_CLK,ENABLE);

    //选择按键的引脚
    GPIO_InitStructure.GPIO_Pin = KEY1_GPIO_PIN;
    // 设置按键的引脚为浮空输入
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    //使用结构体初始化按键
    GPIO_Init(KEY1_GPIO_PORT, &GPIO_InitStructure);

    //选择按键的引脚
    GPIO_InitStructure.GPIO_Pin = KEY2_GPIO_PIN;
    //设置按键的引脚为浮空输入
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    //使用结构体初始化按键
    GPIO_Init(KEY2_GPIO_PORT, &GPIO_InitStructure);
}

uint8_t Key_Scan(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  if( GPIO_ReadInputDataBit(GPIOx, GPIO_Pin) == KEY_ON )
  {
   delay_ms(5);
      if(GPIO_ReadInputDataBit(GPIOx, GPIO_Pin) == KEY_ON)
      {
       // 松手检测
       while( GPIO_ReadInputDataBit(GPIOx, GPIO_Pin) == KEY_ON );
      return KEY_ON;
      }
     else
     {
      return KEY_OFF;
      }
   }
   else
   {
   return KEY_OFF;
   }
}